EmployeeWebClientKnownType/EmployeeWebClient/Web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T03:09:48.9339854Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0427c994-4e9e-453e-8e73-03efaf5efed3}" /><Execution ProcessName="iisexpress" ProcessID="5388" ThreadID="7" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T21:09:48.9309758-06:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo8cuADCapQxHrDINiPUC8sQAAAAAdkP/veA1pUm2Bj3OyJQmAn72PVgPQ2lKkrWV39Ox0mUACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="b3320656-2c09-472d-9ef4-042f2f7610d3" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">0427c994-4e9e-453e-8e73-03efaf5efed3</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>2</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T03:09:49.5318926Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0427c994-4e9e-453e-8e73-03efaf5efed3}" /><Execution ProcessName="iisexpress" ProcessID="5388" ThreadID="7" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T21:09:49.5268766-06:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>536</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 17 Aug 2015 03:09:49 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="a:PartTimeEmployee" xmlns:a="http://schemas.datacontract.org/2004/07/EmployeeService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:DateOfBirth>1987-07-16T00:00:00</a:DateOfBirth><a:Id>2</a:Id><a:Name>John Blogs</a:Name><a:Type>PartTimeEmployee</a:Type><a:HourlyPay>100</a:HourlyPay><a:HoursWorked>8</a:HoursWorked></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T04:29:51.2790581Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0eb2ae67-b777-4341-923f-2993acc0b5d2}" /><Execution ProcessName="iisexpress" ProcessID="4968" ThreadID="5" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T22:29:51.2790581-06:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo9F+vycfA/JAhn0R2lvFiHIAAAAAJ2V9DbJKzkyLpvnwsi85lFRljYNqdU9Hk21onTKvqggACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="3f63f970-e2e2-4156-b30b-b8764a1e0841" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">0eb2ae67-b777-4341-923f-2993acc0b5d2</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T04:29:52.2652037Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0eb2ae67-b777-4341-923f-2993acc0b5d2}" /><Execution ProcessName="iisexpress" ProcessID="4968" ThreadID="5" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T22:29:52.2591845-06:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>515</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 17 Aug 2015 04:29:51 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="a:FullTimeEmployee" xmlns:a="http://schemas.datacontract.org/2004/07/EmployeeService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:DateOfBirth>1987-07-16T00:00:00</a:DateOfBirth><a:Id>1</a:Id><a:Name>Oscar Romero</a:Name><a:Type>FullTimeEmployee</a:Type><a:AnnualSalary>500000</a:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T05:08:01.3140643Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f16f6593-932f-4acd-acab-8ede9145a142}" /><Execution ProcessName="iisexpress" ProcessID="5316" ThreadID="7" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T23:08:01.3130611-06:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo8EJlCH0wU1MmBocDiIkE/gAAAAA4PK8oqoZ1kuRqxYOA1postAiHFlV+KFMnq6cqCgtSHMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:LicenseKey xmlns:h="http://mycompany.com/Employee">QWERTY</h:LicenseKey><ActivityId CorrelationId="4e3a11eb-b311-4851-80d6-2ef6d39aba92" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">f16f6593-932f-4acd-acab-8ede9145a142</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://mycompany.com/Employee"><EmployeeId>1</EmployeeId></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2015-08-17T05:08:02.2390147Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f16f6593-932f-4acd-acab-8ede9145a142}" /><Execution ProcessName="iisexpress" ProcessID="5316" ThreadID="7" /><Channel/><Computer>NETDEVELOPER-PC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2015-08-16T23:08:02.2390147-06:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>354</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 17 Aug 2015 05:08:01 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><EmployeeInfoObject xmlns="http://mycompany.com/Employee"><Id>1</Id><Name>Oscar Romero</Name><DOB>1987-07-16T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>500000</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>